[
  {
    "url": "https://www.th-deg.de/en",
    "title": "Deggendorf Institute of Technology",
    "content": "Welcome to our award-winning university where staff and students boldly develop, study, research, teach and innovate. We are a place of endless opportunities and personal stories, created by each individual member of our inspirational university community. Discover our world and let us inspire you, too! explore your university discover dit virtually WURI Ranking 2023: 1stin \"Entrepreneurial Spirit\" Deggendorf Pfarrkirchen Cham 17 research & technology campuses #count%international students. Discover the world of our DIT merch products The complete academic range of bachelor & master courses we are dedicated to our students, let us inspire you too ... Your student & academic counsellors Career Profiles of successful DIT graduates WHO/Europe has designated the European Campus Rottal-Inn (DIT-ECRI) at Deggendorf Institute of Technology in Germany as a collaborating centre on digital health. Collaborating centres carry out activities in support of various WHO programmes in areas such as medicine, public health, nursing and midwifery, and more. DIT-ECRI will support WHO in strengthening digital health systems, including through policy and strategy development, training and capacity building, as well as research and evaluation of digital health interventions. The collaboration is expected to last 4 years with the possibility of extension. “We are proud to be among 27 WHO partners in Germany and the only one in the field of digital health. We are committed to supporting WHO's vision of using digital technologies to transform health systems and reach underserved populations, as outlined in the WHO Fourteenth General Programme of Work (GPW14),” said Prof. Dr. Georgi Chaltikyan, head of the new center. Dean Prof. Dr. Christian Steckenbauer sees this as “a milestone in health research and in the internationalization of the European Campus”. Specifically, DIT-ECRI’s contributions will include providing data and analyses on existing digital health policies and ethics frameworks,"
  },
  {
    "url": "https://www.th-deg.de/en/apply",
    "title": "Applications | DIT",
    "content": "To begin your studies at the Deggendorf Institute of Technology, apply online only during the application period. During the application process, we will carefully check to see if you can be admitted to DIT. If you are successful, you will receive an offer and will be requested to complete online enrolment. Application procedures may differ depending on the degree programme. None of our programmes requests specific GPAs, although some degree programmes require an online admission test to be passed. All prerequisites can be found on therespective study programme pages. Who can support you The following application periods generally apply for full degree programmes. However, some individual programmes may shorten their application period, so please refer to your degree programme in the followingoverviewto guarentee that you get your application sent off on time. Overview of all deadlines and facts for each individual degree programme: STUDY PROGRAMME SEMESTER START* APPLICATION PERIOD ADMISSION REQUIREMENTS LOCATION LANGUAGE Applied Computer Science University Entrance QualificationLanguage Requirements University Entrance QualificationLanguage Requirements University Entrance QualificationLanguage RequirementsAdmission Test Artificial Intelligence(German) University Entrance QualificationLanguage Requirements Artificial Intelligence(English) University Entrance Qualification(CheckDAAD Eligibility)Language RequirementsAdmission Test University Entrance QualificationLanguage Requirements University Entrance Qualification(CheckDAAD Eligibility)Language Requirements University Entrance QualificationLanguage Requirements University Entrance QualificationLanguage Requirements University Entrance QualificationLanguage Requirements Cyber Security University Entrance QualificationLanguage Requirements Electrical Engineering and Information Technology University Entrance QualificationLanguage Requirements University Entrance QualificationLanguage Requirements Energy Systems En"
  },
  {
    "url": "https://www.th-deg.de/en/study-with-us",
    "title": "Study with us | DIT",
    "content": "Feel at home in our vibrant student community as 41% of our 8400+ students are foreign students from over 100 different nationalities. Read on to find out more about the location, lifestyle & conditions of our modern and multi award-winning university of applied sciences, and view personal impressions and experiences of university life written by students and posted on ourblog. we are dedicated to our students, let us inspire you too ... Your guide to degree courses & exchange programmes taught in English activities and guidance for prospective students Subject choice, application details etc. Aiming to study in German? Earn your language certificate here discover our three teaching campuses Start your studies perfectly prepared Take a look at our events calender and join in to inform yourself about our university, study options, the application process and much more. © 2025 |Technische Hochschule Deggendorf|legal notice|data privacy|accessibility"
  },
  {
    "url": "https://www.th-deg.de/en/further-education/info-applications",
    "title": "Technische Hochschule Deggendorf Webseite",
    "content": "You have informed yourself about ourBachelorandMaster programmesand ouracademic certificates? Are there any questions left unanswered or would you like to apply directly? No problem! In this section we have collected all important information about our offer, the application process and many other helpful tips. For example, you can request information material on both the individual degree programs and ouruniversity certificate coursesquickly and free of charge. In addition, participants report on their experiences with their studies and the resulting professional advantages. In a FAQ we clarify the most frequent questions and answers of students and participants of ouruniversity certificate courses. Scholarships & tax advantages provide you with an overview of funding and support options. And of course you can also apply directly to one of our offers. Studying or further education while working means first of all to decide to complete a course of study or further education in addition to a job. To ensure that this step is successful, our further education officers, seminar managers and lecturers are available to answer your questions at any time. A great advantage of the part-time study programme or part-time continuing education is the proximity to practice: You can immediately put what you have learned into practice and have the opportunity to reflect on what you have heard. In addition to the practical relevance, the exchange and networking within the degree programme is also a major advantage: your fellow students have all also already gained valuable practical experience. The exchange, also with your high-ranking lecturers from science and practice, provides new food for through and often leads to completely new perspectives in addition, you combine your career opportunities through academic studies with the security and income of a permanent job. In a full-time study programme, students do not carry out any full-time activities. Lectures are generally held we"
  },
  {
    "url": "https://www.th-deg.de/en/students",
    "title": "Students | DIT",
    "content": "8 Online job board, activities & seminars to prep for your future Do you have any suggestions for improvement to the university? WHO/Europe has designated the European Campus Rottal-Inn (DIT-ECRI) at Deggendorf Institute of Technology in Germany as a collaborating centre on digital health. Collaborating centres carry out activities in support of various WHO programmes in areas such as medicine, public health, nursing and midwifery, and more. DIT-ECRI will support WHO in strengthening digital health systems, including through policy and strategy development, training and capacity building, as well as research and evaluation of digital health interventions. The collaboration is expected to last 4 years with the possibility of extension. “We are proud to be among 27 WHO partners in Germany and the only one in the field of digital health. We are committed to supporting WHO's vision of using digital technologies to transform health systems and reach underserved populations, as outlined in the WHO Fourteenth General Programme of Work (GPW14),” said Prof. Dr. Georgi Chaltikyan, head of the new center. Dean Prof. Dr. Christian Steckenbauer sees this as “a milestone in health research and in the internationalization of the European Campus”. Specifically, DIT-ECRI’s contributions will include providing data and analyses on existing digital health policies and ethics frameworks, identifying potential gaps, and providing evidence-based recommendations for policy enhancements. DIT-ECRI will collaborate with WHO to revise and refine a comprehensive toolkit covering the planning, deployment, and evaluation of digital health solutions. To improve workforce competencies in digital health, DIT-ECRI will develop targeted training materials, coordinate capacity-building initiatives, and guide the upskilling of health care professionals. Under WHO’s coordination, DIT-ECRI will also engage in research and evaluation of digital health interventions to ensure a robust evidence base for con"
  },
  {
    "url": "https://www.th-deg.de/en/students/documents/application-and-service-fees",
    "title": "Application and Service fees for non-EU/EEA international applications and students | DIT",
    "content": "From the winter semester 2025/26, Deggendorf Institute of Technology will charge the following fees in accordance with Art. 13 Para. 3 Sentence 1 Number 2 of the Bavarian Higher Education Innovation Act (BayHIG) These fees are to cover the costs of checking your documents and the selection process for applications and the services offered in the areas of onboarding, integration and preparation for career entry for international students. You can find more information here:These are our services Regardless of this, the semester fee for thestudent unionas well as any potential costs for an aptitude test still apply. Persons with a nationality outside theEuropean Union (EU)and the European Economic Area (EEA). Theapplication feestarts at the beginning of the application phase for the winter semester 2025/2026 and also applies to the subsequent application phases. The start for theservice feestakes place with the admission / enrolment or re-registration for the winter semester 2025/2026. The tuition fees are charged per semester for the duration of the entire study programme and enrolment at DIT. No service fees are charged for the following persons, subject to appropriate verification: Please refer to the fee regulations for further details, only available in German:Gebührensatzung You can find information on paying the fees in the Primuss Portal. The fee notifications issued in this context are generated there. For information on exemptions or refunds, please contact the relevant colleagues atgebuehren@th-deg.de. They will provide you with all the information you need for the relevant application procedure. From the application phase for thewinter semester 2025/26(start 15 April 2025)➞Application fee EUR 60as a lump sum (multiple applications possible in one application phase)➞ To be paid before documents are checked➞ The application fee does not cover any potential costs for an aptitude test; these may be charged separately if applicable. Fromwinter semester 2025/26➞"
  },
  {
    "url": "https://www.th-deg.de/en/study-with-us/advice-support/faq-potentials",
    "title": "FAQ | DIT",
    "content": "Please find the current application periods on ourapplication page. Requirements differ depending on whether you apply for an undergraduate or postgraduate degree, or an exchange semester. If you are interested in an exchange semester at our university, you will find all information and entry requirements at:www.th-deg.de/en/study-with-us/exchange-students You are welcome to apply for several courses of study. The online application must be filled out individually for each course of study and the relevant documents must be enclosed. References to other applications for admission or previous applications cannot be considered. Important note:A single registration in our application portal PRIMUSS is sufficient – it allows you to apply for multiple study programmes without having to register again. All students are charged astudent union feeof €82 per semester (the academic year consists of 2 semesters per year). In addition to this, administration and support fees will be charged tointernational applicantsstarting with theapplication period for the winter semester 2025/2026, and forinternational enrolled studentsstarting in the winter semester 2025/2026onwards: Regardless of this, the semester fee for thestudent unionas well as any potential costs for an aptitude test still apply. Further information and applicable exceptions can be found here:Application and service fees Hardship case applications allow a small number of studentsdirect admissionwhen exceptional hardship is proven to exist. Exceptional hardship is deemed to exist if the applicant has an exceptional situation where social, health or family reasons make immediate admission to the course of study imperative and an unsuccessful application would create additional problems so that the applicant couldn't be expected to wait even one year for admission. Bavarian universities keep 2% of the study places free for so-called hardship cases, therefore applications are only considered for a few applicants. Hardshi"
  },
  {
    "url": "https://www.th-deg.de/en/students/documents",
    "title": "Documents & Organisation | DIT",
    "content": "plans and subject overview for your degree programme practical courses taught as seminars leave of absence lecture periods, study free periods and exam periods statutes & regulations Module handbooks are the guide to all modules of each undergraduate or postgraduate degree programme. They contain information on prerequisites, contents, learning outcomes, ECTS credit points, duration, work load, literature, references, lecturers of the offered modules and lectures. You can find your lecture schedule atmy.th-deg.de. You only need your university account to log in. Through this platform you can configure your personal lecture schedule and find out on a daily basis if there are any changes or cancellations to your lectures. From 1 January 2025 on DIT students can use the German public transport system for 38€ per month.DIT students can buy the discounted Deutschlandticket via the NETINERA-Tickets app. Here's how it works: The Bavarian discount ticket is a fully-fledged Germany ticket. It is valid nationwide on all means of public transport, i.e. buses, trams, underground trains, suburban trains and regional trains.As long as you study at DIT, your ticket is automatically renewed.Cancellation must take place by the 10th of the previous month. You can find more information directly at Netinera:Netinera Tickets - reduced ticket The following guidelines apply to all faculties and are intended to support you in successfully writing your thesis:Thesis guideline Primuss instructions for registering your thesis.You can find information on final bachelor and master theses in the relevant faculty: You canregister and submit your thesis directlyvia thePrimuss Portal.You can find more information and the upload fields in thePrimuss Portalunder Registration/Submission of Thesis.Short description of the process:1. Students enter the registration in Primuss and generate the registration form as a PDF from it.2. The PDF must be signed by the student and then uploaded back into the port"
  },
  {
    "url": "https://www.th-deg.de/en/students/internationals",
    "title": "Info for international students",
    "content": "Visas, health insurance, funding, etc ... Programmes designed to help you to excel in your studies experience the Bavarian lifestyle in a family unit Intercultural. International. Inspiring. The International Week at Deggendorf Institute of Technology is a yearly event that brings together students, staff, and guests from around the world to promote cultural exchange and global collaboration. A highlight of the week isTaste the World, where international students share traditional dishes from their home countries – a unique chance to explore global cultures through flavor and storytelling. Another key event is theErzählcafé, where personal experiences across cultures are shared in an open, conversational setting. These stories offer valuable insights into life abroad, identity, and connection. International Week invites everyone to discover new perspectives, build international networks, and celebrate the diversity that enriches our campus. Erzählcafé encourages intercultural communication between students from various nations and across all age limits. In cooperation with the Kulturviertel, international students present topics such as personal stories, morals, customs, holidays and traditions from their homeland. A round of discussion about the chosen topic follows after each presentation and international refreshments are provided. More information can be found in theErzählcafé flyer. Participants Registration Date Topic KULTURcafé aims at bringing together people with different backgrounds into a fruitful dialogue. Everyone who is interested in other cultures is invited to join us for the KULTURcafé. We want to welcome students, staff as well citizens of Pfarrkirchen, regardless of their age, religion or origin. The idea is to create a nice welcoming atmosphere in which bridges can be built across all differences. Coffee, tea and international specialities will be provided. Experience other cultures first-hand. Foreign students will share insights into the cultu"
  },
  {
    "url": "https://www.th-deg.de/en/welcome-centre",
    "title": "Welcome Centre | DIT",
    "content": "The Welcome Centre is the first point of contact for international students and prospective international students. We provide guidance with entry and residence formalities, tips for planning your student life on campus, plus support for all other necessary organisation. Inquiries:welcome@th-deg.de we are dedicated to our students, let us inspire you too ... the complete academic range of bachelor & master courses Start your studies perfectly prepared Your guide to degree courses & exchange programmes taught in English #count%international students. © 2025 |Technische Hochschule Deggendorf|legal notice|data privacy|accessibility"
  }
]